# Ведите два числа. Найдите максимальное.

max_number = lambda a, b: a if a > b else b
print(max_number(1, -9))
